main/InformationRegisters/ПрививкиВОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПрививкиВОчереди</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ребенок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Прививка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прививки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

main/CommonModules/РаботаСПрививкамиПовтИсп/Ext/Module.bsl
Функция ПолучитьДанныеОПрививках(ДатаНачалаПериодичности, ДатаОкончанияПериодичности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрививкиВОчереди.Ребенок КАК Ребенок,
		|	ПрививкиВОчереди.Прививка КАК Прививка,
		|	ПрививкиВОчереди.ДатаУстановки КАК ДатаУстановки,
		|	ПрививкиВОчереди.ДатаНапоминания КАК ДатаНапоминания,
		|	ПРЕДСТАВЛЕНИЕ(ПрививкиВОчереди.Ребенок) КАК РебенокПредставление,
		|	ПРЕДСТАВЛЕНИЕ(ПрививкиВОчереди.Прививка) КАК ПрививкаПредставление
		|ИЗ
		|	РегистрСведений.ПрививкиВОчереди КАК ПрививкиВОчереди
		|ГДЕ
		|	ПрививкиВОчереди.ДатаУстановки МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачалаПериодичности));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончанияПериодичности));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции
